app/controllers/tasks_controller.rb

SELECT "tasks".* FROM "tasks" WHERE "tasks"."user_id" = ? AND "tasks"."state" = ?  [["user_id", 1], ["state", "to_do"]]
---
  def index
    @to_do = current_user.tasks.where(state: "to_do")

INSERT INTO "tasks" ("content", "content_html", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["content", "test"], ["content_html", "<p>test</p>"], ["user_id", 1], ["created_at", "2015-01-24 16:03:03.387340"], ["updated_at", "2015-01-24 16:03:03.387340"]]
---
  def create
    @task = current_user.tasks.new(task_params)
    @task.save

UPDATE "tasks" SET "content" = ?, "content_html" = ?, "updated_at" = ? WHERE "tasks"."id" = ?  [["content", "What a dog!\r\n"], ["content_html", "<p>What a dog!\n</p>"], ["updated_at", "2015-01-25 10:48:23.714166"], ["id", 7]]
---
  def update
    @task.update(task_params)

UPDATE "tasks" SET "state" = ?, "updated_at" = ? WHERE "tasks"."id" = ?  [["state", "doing"], ["updated_at", "2015-01-24 15:48:46.076961"], ["id", 3]]
---
  def change
    @task.update_attributes(state: params[:state])